{
  "contact": {
    "name": "Andy Cohen",
    "email": "***************",
    "linkedin": "linkedin.com/in/iamandycohen",
    "location": "Golden Valley, MN"
  },
  "bio": {
    "short": "Founding architect of Sitecore XM Cloud - building enterprise-grade software that scales. Leading CMS development in the Age of AI.",
    "full": "I'm the founding architect of Sitecore XM Cloud, where with the help of an army of Jedi masters, I had the priviledge of designing and building the system from concept to global SaaS launch. I've been building software since I was 8 years old, when I taught myself to code by reading PC magazines my mom brought home from work. That early start gave me a deep understanding of how software systems evolve and what it takes to build things that truly last.\n\nXM Cloud was truly a team effort. Nick Wesselman was the founding Product Manager who conceived the vision and provided the initial push to get the project off the ground, with Dave O'Flanagan and Roger Connolly sponsoring and championing the initiative. I led the architectural design, proof of concept, implementation, and production launch. When Nick moved on, Justin Vogt stepped in as Product Manager and did phenomenal work maintaining momentum and owning the vision. Along the way, I learned immensely from brilliant developers and architects, most notably Alistair Deneys and Charlie Turano, whose insights shaped both the technical approach and my own growth as an architect. After launch, I focused on optimization and redesign, cutting costs significantly while re-architecting tenancy and infrastructure to save millions. I also drove the cultural shift to continuous delivery, fundamentally changing how we ship software and scale our systems.\n\nMy specialty is building enterprise-grade software that scales - specifically the content management systems themselves: the engines, APIs, and infrastructure that enable content management at enterprise scale. From those early programming days to building applicant tracking systems, time management tools, and eventually enterprise CMS solutions, I've consistently built the robust, scalable foundations that others build upon.\n\nAt Altudo, I'm working on the future of CMS in the Age of AI - developing agentic workflows and AI-driven experiences that transform how content management works. I'm not just adding AI features; I'm reimagining how these systems can use AI to speed up implementation, improve authoring experiences, and deliver intelligent content orchestration.\n\nThroughout my career, I've specialized in architecture and product development across consulting and product companies - from building internal tools at TempWorks and ILM to designing enterprise solutions at Horizontal Integration, Perficient, and Avanade, before leading development at Sitecore.\n\nMy approach combines decades of hands-on development with engineering expertise, AI innovation, and product strategy. Having grown up alongside the evolution of software development, I understand both the fundamentals and the cutting edge. I focus on building systems that scale to serve millions while enabling developers and content creators to achieve more. I thrive at the intersection of engineering and AI - designing next-generation CMS systems, building great developer experiences, and defining how content management evolves in an AI-driven world.\n\nWhether it's enterprise systems serving millions of users or innovative AI workflows that transform content operations, I believe in building solid foundations that last and enable others to create extraordinary digital experiences."
  },
  "professional": {
    "keywords": [
      "Andy Cohen",
      "CMS Architecture",
      "AI-Driven Content Management",
      "Sitecore XM Cloud",
      "Software Engineering",
      "Digital Experience Systems",
      "Agentic AI Workflows",
      "Content Management Development"
    ],
    "expertise": [
      "CMS Architecture",
      "AI-Driven Content Management",
      "Software Engineering",
      "Digital Experience Systems",
      "Agentic AI Workflows",
      "SaaS Development",
      "Content Management Systems",
      "Developer Experience"
    ],
    "skills": [
      "CMS Development",
      "AI-Driven Content Management",
      "Software Architecture",
      "Agentic AI Workflows",
      "Digital Experience Systems",
      "SaaS Engineering",
      "Cloud-Native Architecture",
      "Developer Experience Design",
      "Content Management APIs",
      "Microservices Architecture",
      "Continuous Delivery",
      "Team Leadership",
      "Product Strategy",
      "JavaScript",
      "React",
      "TypeScript",
      "Next.js",
      "C#",
      ".NET",
      "LLM Integration",
      "MCP",
      "Cursor AI",
      "System Scaling"
    ]
  },
  "resume": [
    {
      "title": "Vice President | Chief Architect",
      "company": "Altudo",
      "period": "Sep 2024 - Present",
      "highlights": [
        "Leading CMS architecture strategies for the Age of AI",
        "Pioneering agentic AI workflows that transform content management systems",
        "Designing next-generation digital experience systems with AI integration",
        "Defining the future of content management through AI-driven innovation"
      ],
      "description": "Leading the evolution of content management systems in the Age of AI. Pioneering agentic workflows and intelligent architectures that fundamentally transform how CMS systems operate, scale, and deliver value to enterprise clients."
    },
    {
      "title": "Senior Director, Engineering – XM Cloud",
      "company": "Sitecore",
      "period": "May 2024 - Sep 2024",
      "highlights": [
        "Directed engineering and architecture roadmap for XM Cloud",
        "Achieved significant cost reductions through architectural optimization",
        "Led scaling initiatives and infrastructure modernization",
        "Transformed engineering practices for large-scale development"
      ],
      "description": "Directed the engineering roadmap and architecture for Sitecore XM Cloud, achieving substantial cost optimizations while scaling the system to serve enterprise clients globally."
    },
    {
      "title": "Principal Architect – XM Cloud",
      "company": "Sitecore",
      "period": "Apr 2023 - May 2024",
      "highlights": [
        "Built cloud-native content management system from the ground up",
        "Designed edge-driven content delivery architecture for enterprise scale",
        "Led architecture from inception through production launch",
        "Established architectural patterns for modern CMS development"
      ],
      "description": "Built the foundational architecture for Sitecore's XM Cloud, designing cloud-native content management that enables industry-leading digital experiences at enterprise scale."
    },
    {
      "title": "System Architect - Content",
      "company": "Sitecore",
      "period": "Jul 2020 - Mar 2023",
      "highlights": [
        "Led transformation from monolithic to cloud-native SaaS architecture",
        "Built microservices system for headless content management",
        "Established continuous delivery practices for development teams",
        "Created scalable content management serving millions of requests"
      ],
      "description": "Led the foundational transformation of Sitecore's architecture from monolithic systems to cloud-native SaaS, building microservices solutions and establishing modern development practices."
    },
    {
      "title": "Solutions Architect – Sales Engineering",
      "company": "Sitecore",
      "period": "Sep 2019 - Jul 2020",
      "highlights": [
        "Created compelling demonstrations showcasing enterprise CMS capabilities",
        "Designed solutions for complex enterprise content management needs",
        "Translated technical capabilities into business value for enterprise clients",
        "Influenced product roadmap based on enterprise customer requirements"
      ],
      "description": "Designed and executed demonstrations that showcased Sitecore's enterprise CMS capabilities, directly influencing product development priorities and customer success."
    },
    {
      "title": "Group Manager, Solution Development",
      "company": "Avanade",
      "period": "Jun 2019 - Sep 2019",
      "highlights": [
        "Delivered enterprise CMS integrations for major telecommunications client",
        "Built content management solutions enabling large-scale content operations",
        "Led integration projects with complex enterprise requirements",
        "Managed development teams building content management systems"
      ],
      "description": "Delivered comprehensive enterprise CMS solutions for a major telecommunications client, building content management systems that enabled large-scale internal content operations."
    },
    {
      "title": "Sitecore Solutions Architect",
      "company": "Perficient",
      "period": "Oct 2018 - Jun 2019",
      "highlights": [
        "Built enterprise-scale CMS implementations on cloud infrastructure",
        "Designed content management with advanced governance and security",
        "Created scalable digital experience systems for enterprise clients",
        "Optimized CMS performance and reliability at scale"
      ],
      "description": "Built scalable content management solutions on cloud infrastructure, focusing on enterprise-grade governance, security, and performance optimization for large-scale implementations."
    },
    {
      "title": "Technology Director",
      "company": "Horizontal Integration",
      "period": "Oct 2013 - Sep 2017",
      "highlights": [
        "Built reusable content management solutions",
        "Established enterprise-level development practices for teams",
        "Led development initiatives that accelerated delivery timelines",
        "Created foundation for modern CMS development methodologies"
      ],
      "description": "Built reusable content management solutions and established enterprise-level development practices, creating the foundation for scalable development across multiple client implementations."
    },
    {
      "title": "Principal I Consultant",
      "company": "ILM Professional Services",
      "period": "Mar 2013 - Oct 2013",
      "highlights": [
        "Delivered enterprise solutions for major clients including General Mills and ShopNBC",
        "Built .NET-based content management and e-commerce systems",
        "Created scalable solutions across diverse industry verticals",
        "Established development practices for enterprise clients"
      ],
      "description": "Delivered comprehensive solutions for major enterprise clients including General Mills and ShopNBC, focusing on scalable content management and e-commerce architecture."
    },
    {
      "title": "Web Development Manager",
      "company": "TempWorks Software",
      "period": "Apr 2010 - Mar 2013",
      "highlights": [
        "Built and shipped web-based applicant tracking system from concept to production",
        "Developed comprehensive time tracking and job application management tools",
        "Created software solutions serving staffing and recruitment industry",
        "Led development team building enterprise software"
      ],
      "description": "Built and shipped multiple web-based solutions including applicant tracking, time management, and job application systems while leading development teams, establishing the foundation for enterprise software development expertise."
    }
  ],
  "projects": [
    {
      "title": "Treehouse Builder",
      "period": "Sep 2024",
      "description": "During the month between working at Sitecore and Altudo, and with the help of Justin Vogt, I was able to build a treehouse for my children Marty and Caroline.",
      "highlights": [
        "4-season weatherproofing and insulation for year-round use",
        "Structural engineering for 12-foot elevated framework stability",
        "Custom 8'×8' construction with integrated windows and door",
        "Hand-crafted ladder and deck systems for safe access",
        "Vibrant blue and yellow color scheme designed with children in mind",
        "Complete electrical planning and safety considerations"
      ]
    }
  ],
  "community": {
    "mvpStatus": "Sitecore MVP",
    "mvpAwards": [
      {
        "year": "2025",
        "type": "Honorary",
        "status": "Current",
        "description": "Named as a 2025 Honorary MVP, a rarely awarded distinction recognizing exceptional contributions to the Sitecore ecosystem.",
        "announcementUrl": "https://www.sitecore.com/company/newsroom/press-releases/2025/01/sitecore-announces-2025-most-valuable-professionals",
        "quote": "Andy Cohen dedicated five years to Sitecore, establishing himself as a prominent figure within the community. As one of the principal architects of XM Cloud, he championed its development from the outset. In recognition of his significant contributions, we are honored to present Andy with the Honorary MVP award.",
        "quoteSource": "Danny Robinson, CTO of Sitecore"
      },
      {
        "year": "2017",
        "type": "Technology",
        "status": "Alumni",
        "description": "Recognized as a Technology MVP for technical expertise, community engagement, and knowledge sharing within the Sitecore ecosystem."
      },
      {
        "year": "2016",
        "type": "Technology",
        "status": "Alumni",
        "description": "First MVP recognition for technical leadership, community contributions, and dedication to advancing Sitecore development practices."
      }
    ],
    "mvpProfileUrl": "https://mvp.sitecore.com/en/Directory/Profile?id=7a7a68872ab1437ed8ec08dd030ff642",
    "description": "Community leadership through presentations, podcasts, and thought leadership content sharing insights on CMS architecture, XM Cloud development, and the future of AI-driven content management",
    "mediaResources": {
      "podcasts": [
        {
          "title": "The Sitecore Water Cooler",
          "url": "https://cms.megaphone.fm/channel/AAE2118464403",
          "description": "In-depth discussions on CMS architecture, XM Cloud development, and industry insights"
        },
        {
          "title": "Listen on Megaphone",
          "url": "https://megaphone.link/AAE6951160485",
          "description": "Podcast platform access"
        }
      ]
    },
    "presentations": [
      {
        "title": "SUGCON Europe 2025",
        "organization": "SUGCON",
        "location": "Antwerp, Belgium",
        "date": "April 2025",
        "sessionTitle": "Full Circle: The Architect of XM Cloud builds an XM Cloud Site (as a partner for the first time)",
        "topics": [
          "XM Cloud",
          "Architecture",
          "Partner Implementation"
        ],
        "description": "A unique perspective presentation where the founding architect of XM Cloud demonstrates building an XM Cloud site as a partner implementation, offering insights into both the platform creation and practical implementation challenges.",
        "sessionizeUrl": "https://sessionize.com/iamandycohen"
      },
      {
        "title": "SUGCON India 2024",
        "organization": "SUGCON",
        "location": "Bangalore,India",
        "date": "2024",
        "sessionTitle": "💘Heart to Heart with an XM Cloud Architect💘 (with Liz)",
        "topics": [
          "XM Cloud Architecture",
          "Candid Review",
          "Collaboration"
        ],
        "description": "Collaborative presentation with Liz Nelson offering a candid review of the XM Cloud journey, sharing wins, losses, and insights from the founding architect's perspective alongside implementation expertise.",
        "videoUrl": "https://www.youtube.com/watch?v=IEbZIOVPzW4&list=PLvwdDTmlDsRwv59ccvK5sodnaLLu9_AfT&index=9"
      },
      {
        "title": "SUGCON Europe 2024",
        "organization": "SUGCON",
        "location": "Dublin, Ireland",
        "date": "April 2024",
        "sessionTitle": "Building for Resiliency",
        "topics": [
          "System Architecture",
          "Scalability",
          "Performance"
        ],
        "description": "Explored architectural patterns and best practices for building resilient, scalable CMS systems that can withstand high traffic loads and provide consistent performance under varying conditions.",
        "videoUrl": "https://youtu.be/3zLjcHzGT9E?si=BNfEocwSaqBpd7oj&t=33",
        "sessionizeUrl": "https://sessionize.com/andy-cohen"
      },
      {
        "title": "SUGCON ANZ 2023",
        "organization": "SUGCON",
        "location": "Sydney, Australia",
        "date": "2023",
        "sessionTitle": "Building for Resiliency",
        "topics": [
          "Regional Architecture",
          "Global Implementation",
          "Best Practices"
        ],
        "description": "Adapted presentation for the Asia-Pacific audience, focusing on regional considerations for building resilient CMS systems and sharing lessons learned from global implementations."
      },
      {
        "title": "SUGCON India 2023",
        "organization": "SUGCON",
        "location": "Delhi, India",
        "date": "2023",
        "sessionTitle": "Build for XM Cloud according to the Architect of XM Cloud",
        "topics": [
          "XM Cloud",
          "Architecture",
          "Best Practices",
          "Technical Leadership"
        ],
        "description": "Direct guidance from the founding architect of XM Cloud on best practices and design principles for building future-proof applications. A comprehensive walkthrough covering content creation, site design, frontend development, hosting, and system integrations.",
        "videoUrl": "https://youtu.be/d8u6de7zeAQ?si=ugyOIgvJXv5RUEIm&t=39"
      },
      {
        "title": "SUGCON North America 2023",
        "organization": "SUGCON",
        "location": "Minneapolis, Minnesota",
        "date": "2023",
        "sessionTitle": "Build for XM Cloud according to the Architect of XM Cloud",
        "topics": [
          "XM Cloud",
          "Developer Experience",
          "Best Practices",
          "Live Demo"
        ],
        "description": "Hear directly from the Architect of XM Cloud about how you should be building on XM Cloud to future proof your apps.",
        "videoUrl": "https://www.youtube.com/watch?v=_nkH-HQX-QQ",
        "isLiveDemo": true
      },
      {
        "title": "SUGCON Europe 2023",
        "organization": "SUGCON",
        "location": "Malaga, Spain",
        "date": "2023",
        "sessionTitle": "Innovations in Deploy",
        "topics": [
          "Live Demo",
          "Deployment Innovation",
          "CI/CD Automation",
          "DevOps"
        ],
        "description": "Live demonstration of cutting-edge deployment strategies and automation techniques for modern CMS implementations, showcasing CI/CD pipelines and cloud-native deployment patterns through hands-on examples.",
        "videoUrl": "https://www.youtube.com/watch?v=50Vu6Bp--f0&t=23s",
        "isLiveDemo": true
      },
      {
        "title": "SUGCON ANZ 2022",
        "organization": "SUGCON",
        "location": "Melbourne, Australia",
        "date": "2022",
        "sessionTitle": "XM Cloud - Developer Experience",
        "topics": [
          "XM Cloud",
          "Developer Experience",
          "Live Demo",
          "Technical Demo"
        ],
        "description": "Technical demonstration of XM Cloud focusing on developer experience, including CLI commands, the new Cloud portal launchpad for composable apps, and introduction to Pages as a replacement for Horizon editor. Emphasized XM Cloud's headless-only architecture while showcasing built-in analytics and personalization capabilities.",
        "documentationUrl": "https://cadewhitbourn.com/sitecore/sitecore-user-group-conference-sugcon-anz-2022-reflections-and-key-takeaways/",
        "documentationQuote": "Andy Cohen worked through a demo of XM Cloud. A fair bit of the technical content in this session went beyond me, particularly all the stuff that involved pumping out commands in the CLI. However, it was good to get eyes on the new Cloud portal launchpad where all the composable apps can be accessed. I also noted the mention of Pages, a replacement for Horizon editor. Andy was clear, XM Cloud is headless only, so to be clear, it is headless only.",
        "documentationSource": "Conference Reflection by Cade Whitbourn",
        "isLiveDemo": true
      },
      {
        "title": "Sitecore Symposium 2022",
        "organization": "Sitecore",
        "location": "Chicago, Illinois",
        "date": "October 2022",
        "sessionTitle": "Meet the Architects",
        "topics": [
          "Enterprise Architecture",
          "Panel Discussion",
          "Strategic Planning"
        ],
        "description": "Participated in the exclusive architect panel session, sharing insights on enterprise-scale CMS architecture decisions and the future direction of content management systems."
      },
      {
        "title": "SUGCON Europe 2022",
        "organization": "SUGCON",
        "location": "Budapest, Hungary",
        "date": "April 2022",
        "sessionTitle": "XM Cloud - Build and Deploy in less than 5 minutes",
        "topics": [
          "Historic Demo",
          "XM Cloud Launch",
          "Live Deployment"
        ],
        "description": "Historic live demonstration of Sitecore's next generation product, XM Cloud. The very first public demonstration of XM Cloud Deploy, successfully deploying Sitecore from an empty cloud environment in just over 5 minutes. This session introduced the Sitecore community to what XM Cloud is, what it isn't, and marked the beginning of the SaaS journey for Sitecore.",
        "videoUrl": "https://youtu.be/Sm4X6EG8fCU?si=grZaN16g-2V9sHaF&t=44",
        "documentationUrl": "https://www.flux-digital.com/blog/sugcon-2022-thoughts-takeaways/",
        "documentationQuote": "Andy had a few technical issues (as is often the way with complex live demos) but he managed to deploy Sitecore using Cloud deploy in Just over 5 minutes! That's pretty impressive from an empty environment in the cloud.",
        "documentationSource": "Community Documentation by Adam Seabridge (7x Sitecore MVP)",
        "isLiveDemo": true,
        "isHistoric": true
      },
      {
        "title": "Sitecore Symposium 2019",
        "organization": "Sitecore",
        "location": "Orlando, Florida",
        "date": "October 2019",
        "sessionTitle": "Compassion in Tech (with Thomas Lin)",
        "topics": [
          "Compassion in Tech",
          "Human-Centered Development",
          "Technology Ethics"
        ],
        "description": "Co-presented with Thomas Lin on bringing compassion into technology development, exploring how empathy and human-centered approaches can transform how we build and implement technical solutions in the enterprise."
      }
    ],
    "featuredMedia": {
      "title": "The Sitecore Water Cooler Podcast",
      "episode": "The New Age of Building a Sitecore Solution",
      "description": "Featured guest discussing how XM Cloud and modern architectural patterns are transforming CMS development and implementation strategies for enterprise clients.",
      "blogUrl": "https://www.americaneagle.com/insights/blog/post/the-sitecore-water-cooler-podcast-the-new-age-of-building-a-sitecore-solution",
      "podcastUrl": "https://dcs-spotify.megaphone.fm/AAE6951160485.mp3?key=37f9b5eca2f6c86d79b3149a23f7e33f&request_event_id=d2ecdaa9-8b66-443e-97ca-28006aecfe9c&session_id=d2ecdaa9-8b66-443e-97ca-28006aecfe9c&source=3&timetoken=1756008698_5C371E112A7630CE481F28B3B9833EA2",
      "videoUrl": "https://www.youtube.com/watch?v=nBZFVywp_L4"
    },
    "expertiseAreas": [
      {
        "category": "Technical Leadership",
        "topics": [
          "CMS Architecture & Scalability",
          "Cloud-Native Content Management",
          "Enterprise Digital Transformation",
          "Modern Development Practices"
        ]
      },
      {
        "category": "Innovation & Strategy",
        "topics": [
          "AI-Driven Content Management",
          "Agentic Workflows & Automation",
          "Platform Engineering Best Practices",
          "Future of CMS in the Age of AI"
        ]
      }
    ]
  }
}
